Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
on.current: Reading...
module.security.data.aws_ses_email_identity.ses_source_email: Reading...
module.security.module.lambda-sendSecurityAlert.data.aws_region.current: Reading...
module.security.module.lambda-sendSecurityAlert.data.aws_caller_identity.current: Reading...
module.security.data.aws_caller_identity.this: Reading...
module.security.module.lambda-sendSecurityAlert.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.security.module.lambda-sendSecurityAlert.data.aws_partition.current: Read complete after 0s [id=aws]
module.security.module.lambda-sendSecurityAlert.data.aws_caller_identity.current: Read complete after 0s [id=127214202110]
module.security.data.aws_caller_identity.this: Read complete after 0s [id=127214202110]
module.sbeacon.module.lambda-submitDataset.data.aws_iam_policy_document.assume_role[0]: Reading...
module.cognito.module.lambda-logEmailDelivery.data.external.archive_prepare[0]: Reading...
module.cognito.module.lambda-sendRegistrationEmail.data.external.archive_prepare[0]: Reading...
module.cognito.module.lambda-customMessageLambdaTrigger.data.external.archive_prepare[0]: Reading...
module.sbeacon.module.lambda-deidentifyFiles.data.aws_iam_policy_document.assume_role[0]: Reading...
module.sbeacon.module.lambda-submitDataset.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.cognito.module.lambda-sendSvepJobEmail.data.external.archive_prepare[0]: Reading...
module.sbeacon.module.lambda-deidentifyFiles.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.sbeacon.module.lambda-getDatasets.data.aws_iam_policy_document.assume_role[0]: Reading...
module.sbeacon.module.lambda-generateReports.data.aws_iam_policy_document.assume_role[0]: Reading...
module.sbeacon.module.lambda-getDatasets.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.sbeacon.module.lambda-getInfo.data.aws_iam_policy_document.assume_role[0]: Reading...
module.sbeacon.module.lambda-generateReports.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.sbeacon.module.lambda-getInfo.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.sbeacon.module.lambda-getAnalyses.data.aws_iam_policy_document.assume_role[0]: Reading...
module.sbeacon.module.lambda-getAnalyses.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.sbeacon.module.lambda-getConfiguration.data.aws_iam_policy_document.assume_role[0]: Reading...
module.sbeacon.module.lambda-updateFiles.data.aws_iam_policy_document.assume_role[0]: Reading...
module.sbeacon.module.lambda-getEntryTypes.data.aws_iam_policy_document.assume_role[0]: Reading...
module.sbeacon.module.lambda-getConfiguration.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.sbeacon.module.lambda-updateFiles.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.sbeacon.module.lambda-getEntryTypes.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.sbeacon.module.lambda-splitQuery.data.aws_iam_policy_document.assume_role[0]: Reading...
module.svep[0].module.lambda-queryVCFsubmit.data.aws_iam_policy_document.assume_role[0]: Reading...
module.svep[0].module.lambda-queryVCFsubmit.data.external.archive[0]: Reading...
module.svep[0].module.lambda-queryVCFsubmit.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.sbeacon.module.lambda-splitQuery.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.sbeacon.data.aws_iam_policy.AWSGlueServiceRole: Read complete after 1s [id=arn:aws:iam::aws:policy/service-role/AWSGlueServiceRole]
module.cognito.data.aws_iam_policy_document.gaspi_unauthenticated_role_policy: Reading...
module.cognito.module.lambda-sendSvepJobEmail.data.aws_partition.current: Reading...
module.cognito.module.lambda-sendRegistrationEmail.data.aws_caller_identity.current: Reading...
module.cognito.module.lambda-sendRegistrationEmail.data.aws_caller_identity.current: Read complete after 0s [id=127214202110]
module.cognito.data.aws_iam_policy_document.gaspi_unauthenticated_role_policy: Read complete after 0s [id=456311145]
module.cognito.module.lambda-sendSvepJobEmail.data.aws_partition.current: Read complete after 0s [id=aws]
module.cognito.module.lambda-customMessageLambdaTrigger.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.cognito.module.lambda-sendSvepJobEmail.data.aws_region.current: Reading...
module.cognito.module.lambda-customMessageLambdaTrigger.data.aws_region.current: Reading...
module.cognito.data.aws_iam_policy_document.gaspi_authenticated_role_policy: Reading...
module.cognito.data.aws_ses_email_identity.ses_source_email: Reading...
module.cognito.data.aws_iam_policy_document.gaspi_authenticated_role_policy: Read complete after 0s [id=1647641194]
module.cognito.module.lambda-sendSvepJobEmail.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.cognito.module.lambda-customMessageLambdaTrigger.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.svep[0].module.lambda-queryVCFsubmit.data.external.archive[0]: Read complete after 0s [id=-]
module.cognito.data.aws_caller_identity.this: Reading...
module.cognito.module.lambda-customMessageLambdaTrigger.data.aws_partition.current: Reading...
module.cognito.module.lambda-logEmailDelivery.data.aws_region.current: Reading...
module.cognito.module.lambda-sendRegistrationEmail.data.aws_region.current: Reading...
module.svep[0].module.lambda-getResultsURL.data.external.archive[0]: Reading...
module.cognito.module.lambda-customMessageLambdaTrigger.data.aws_partition.current: Read complete after 0s [id=aws]
module.cognito.module.lambda-sendRegistrationEmail.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.cognito.module.lambda-logEmailDelivery.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.cognito.data.aws_caller_identity.this: Read complete after 0s [id=127214202110]
module.svep[0].module.lambda-getResultsURL.data.aws_iam_policy_document.assume_role[0]: Reading...
module.cognito.module.lambda-sendSvepJobEmail.data.aws_caller_identity.current: Reading...
module.svep[0].module.lambda-concat.data.aws_iam_policy_document.assume_role[0]: Reading...
module.svep[0].module.lambda-concat.data.external.archive[0]: Reading...
module.svep[0].module.lambda-getResultsURL.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.cognito.data.aws_iam_policy_document.admin_group_role_policy: Reading...
module.cognito.module.lambda-logEmailDelivery.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.cognito.module.lambda-sendSvepJobEmail.data.aws_caller_identity.current: Read complete after 0s [id=127214202110]
module.cognito.data.aws_iam_policy_document.manager_group_role_policy: Reading...
module.cognito.data.aws_iam_policy_document.admin_group_role_policy: Read complete after 0s [id=389356507]
module.cognito.module.lambda-sendRegistrationEmail.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.svep[0].module.lambda-concat.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.cognito.module.lambda-sendRegistrationEmail.data.aws_partition.current: Reading...
module.svep[0].module.lambda-queryGTF.data.aws_iam_policy_document.assume_role[0]: Reading...
module.cognito.module.lambda-logEmailDelivery.data.aws_partition.current: Reading...
module.cognito.module.lambda-logEmailDelivery.data.aws_caller_identity.current: Reading...
module.cognito.data.aws_iam_policy_document.manager_group_role_policy: Read complete after 0s [id=2480309385]
module.svep[0].module.lambda-queryGTF.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.cognito.module.lambda-logEmailDelivery.data.aws_caller_identity.current: Read complete after 0s [id=127214202110]
module.cognito.module.lambda-sendRegistrationEmail.data.aws_partition.current: Read complete after 0s [id=aws]
module.cognito.module.lambda-customMessageLambdaTrigger.data.aws_caller_identity.current: Reading...
module.cognito.module.lambda-logEmailDelivery.data.aws_partition.current: Read complete after 0s [id=aws]
module.svep[0].module.lambda-pluginGnomad.data.aws_iam_policy_document.assume_role[0]: Reading...
module.svep[0].module.lambda-getResultsURL.data.external.archive[0]: Read complete after 0s [id=-]
module.svep[0].module.lambda-initQuery.data.aws_iam_policy_document.assume_role[0]: Reading...
module.svep[0].module.lambda-concatPages.data.aws_iam_policy_document.assume_role[0]: Reading...
module.cognito.module.lambda-sendSvepJobEmail.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.svep[0].module.lambda-initQuery.data.external.archive[0]: Reading...
module.svep[0].module.lambda-queryGTF.data.external.archive[0]: Reading...
module.cognito.module.lambda-customMessageLambdaTrigger.data.aws_caller_identity.current: Read complete after 0s [id=127214202110]
module.svep[0].module.lambda-createPages.data.external.archive[0]: Reading...
module.svep[0].module.lambda-initQuery.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.svep[0].module.lambda-concatPages.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.svep[0].module.lambda-pluginGnomad.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.svep[0].module.lambda-pluginGnomad.data.external.archive[0]: Reading...
module.svep[0].module.lambda-createPages.data.aws_iam_policy_document.assume_role[0]: Reading...
module.svep[0].module.lambda-sendJobEmail.data.aws_iam_policy_document.assume_role[0]: Reading...
module.svep[0].module.lambda-sendJobEmail.data.external.archive[0]: Reading...
module.svep[0].module.lambda-concatPages.data.external.archive[0]: Reading...
module.svep[0].module.lambda-concat.data.external.archive[0]: Read complete after 1s [id=-]
module.svep[0].module.lambda-createPages.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.svep[0].module.lambda-sendJobEmail.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.svep[0].module.lambda-pluginClinvar.data.external.archive[0]: Reading...
module.svep[0].module.lambda-pluginClinvar.data.aws_iam_policy_document.assume_role[0]: Reading...
module.svep[0].module.lambda-pluginClinvar.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.webgui.data.aws_cloudfront_cache_policy.bui-s3-distribution-cache-policy: Reading...
module.svep[0].module.lambda-queryVCF.data.external.archive[0]: Reading...
module.svep[0].module.lambda-initQuery.data.external.archive[0]: Read complete after 1s [id=-]
module.svep[0].module.lambda-queryVCF.data.aws_iam_policy_document.assume_role[0]: Reading...
module.svep[0].module.lambda-queryGTF.data.external.archive[0]: Read complete after 1s [id=-]
module.svep[0].module.lambda-queryVCF.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.svep[0].module.lambda-pluginClinvar.data.external.archive[0]: Read complete after 0s [id=-]
module.svep[0].module.lambda-createPages.data.external.archive[0]: Read complete after 1s [id=-]
module.svep[0].module.lambda-pluginGnomad.data.external.archive[0]: Read complete after 0s [id=-]
module.svep[0].module.python_modules_layer.data.external.archive_prepare[0]: Reading...
module.svep[0].module.lambda-formatOutput.data.aws_iam_policy_document.assume_role[0]: Reading...
module.svep[0].module.lambda-updateReferenceFiles.data.external.archive_prepare[0]: Reading...
module.svep[0].module.lambda-formatOutput.data.external.archive[0]: Reading...
module.svep[0].module.lambda-formatOutput.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.svep[0].module.lambda-concatPages.data.external.archive[0]: Read complete after 0s [id=-]
module.svep[0].module.lambda-sendJobEmail.data.external.archive[0]: Read complete after 0s [id=-]
module.sbeacon.module.lambda-getRuns.data.aws_iam_policy_document.assume_role[0]: Reading...
module.svep[0].module.lambda-concatStarter.data.aws_iam_policy_document.assume_role[0]: Reading...
module.svep[0].module.lambda-concatStarter.data.external.archive[0]: Reading...
module.svep[0].module.lambda-clearTempAndRegions.data.external.archive_prepare[0]: Reading...
module.sbeacon.module.lambda-getRuns.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.svep[0].module.lambda-concatStarter.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.svep[0].module.lambda-queryVCF.data.external.archive[0]: Read complete after 0s [id=-]
module.svep[0].module.lambda-concatStarter.data.external.archive[0]: Read complete after 0s [id=-]
module.svep[0].module.lambda-formatOutput.data.external.archive[0]: Read complete after 0s [id=-]
module.sbeacon.data.aws_iam_policy_document.lambda-generateReports: Reading...
module.sbeacon.data.aws_iam_policy_document.lambda-generateReports: Read complete after 0s [id=722894329]
module.svep[0].module.lambda-updateReferenceFiles.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.svep[0].module.python_modules_layer.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.svep[0].module.lambda-clearTempAndRegions.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.webgui.data.aws_cloudfront_cache_policy.bui-s3-distribution-cache-policy: Read complete after 1s [id=658327ea-f89d-4fab-a63d-7e88639e58f6]
module.security.data.aws_iam_policy_document.lambda-sendSecurityAlert: Reading...
module.sbeacon.module.lambda-admin.data.aws_iam_policy_document.assume_role[0]: Reading...
module.security.data.aws_iam_policy_document.lambda-sendSecurityAlert: Read complete after 0s [id=3304041542]
module.sbeacon.module.lambda-admin.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.sbeacon.module.lambda-getIndividuals.data.aws_iam_policy_document.assume_role[0]: Reading...
module.sbeacon.module.lambda-getIndividuals.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.sbeacon.module.lambda-generateCohortVCfs.data.aws_iam_policy_document.assume_role[0]: Reading...
module.sbeacon.module.lambda-indexer.data.aws_iam_policy_document.assume_role[0]: Reading...
module.sbeacon.module.lambda-generateCohortVCfs.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.sbeacon.module.lambda-indexer.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.security.module.lambda-sendSecurityAlert.data.aws_iam_policy_document.assume_role[0]: Reading...
module.security.module.lambda-sendSecurityAlert.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.cognito.module.lambda-sendRegistrationEmail.data.aws_iam_policy_document.assume_role[0]: Reading...
module.cognito.module.lambda-sendSvepJobEmail.data.aws_iam_policy_document.assume_role[0]: Reading...
module.cognito.module.lambda-sendRegistrationEmail.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.cognito.module.lambda-logEmailDelivery.data.aws_iam_policy_document.assume_role[0]: Reading...
module.cognito.module.lambda-customMessageLambdaTrigger.data.aws_iam_policy_document.assume_role[0]: Reading...
module.cognito.module.lambda-logEmailDelivery.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.cognito.module.lambda-customMessageLambdaTrigger.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.cognito.module.lambda-sendSvepJobEmail.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.svep[0].module.lambda-pluginConsequence.data.aws_iam_policy_document.assume_role[0]: Reading...
module.svep[0].module.lambda-pluginConsequence.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.svep[0].module.lambda-qcFigures.data.aws_iam_policy_document.assume_role[0]: Reading...
module.svep[0].module.lambda-updateReferenceFiles.data.aws_iam_policy_document.assume_role[0]: Reading...
module.svep[0].module.lambda-clearTempAndRegions.data.aws_iam_policy_document.assume_role[0]: Reading...
module.svep[0].module.lambda-qcFigures.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.svep[0].module.lambda-updateReferenceFiles.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.svep[0].module.lambda-clearTempAndRegions.data.aws_iam_policy_document.assume_role[0]: Read complete after 1s [id=2690255455]
module.svep[0].module.lambda-formatOutput.data.aws_iam_policy_document.logs[0]: Reading...
module.svep[0].module.lambda-sendJobEmail.data.aws_iam_policy_document.logs[0]: Reading...
module.svep[0].module.lambda-initQuery.data.aws_iam_policy_document.logs[0]: Reading...
module.svep[0].module.lambda-concatStarter.data.aws_iam_policy_document.logs[0]: Reading...
module.svep[0].module.lambda-pluginGnomad.data.aws_iam_policy_document.logs[0]: Reading...
module.svep[0].module.lambda-concatStarter.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=3949247289]
module.svep[0].module.lambda-formatOutput.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=269662083]
module.svep[0].module.lambda-sendJobEmail.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=657000114]
module.svep[0].module.lambda-initQuery.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=4179320484]
module.svep[0].module.lambda-pluginGnomad.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=2484114338]
module.svep[0].module.lambda-queryVCF.data.aws_iam_policy_document.logs[0]: Reading...
module.svep[0].module.lambda-concatPages.data.aws_iam_policy_document.logs[0]: Reading...
module.svep[0].module.lambda-queryGTF.data.aws_iam_policy_document.logs[0]: Reading...
module.svep[0].module.lambda-createPages.data.aws_iam_policy_document.logs[0]: Reading...
module.svep[0].module.lambda-concatPages.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=903039367]
module.svep[0].module.lambda-getResultsURL.data.aws_iam_policy_document.logs[0]: Reading...
module.svep[0].module.lambda-queryVCF.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=1635098275]
module.svep[0].module.lambda-createPages.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=1764633960]
module.svep[0].module.lambda-queryGTF.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=2382463831]
module.svep[0].module.lambda-getResultsURL.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=1882988668]
module.svep[0].module.lambda-queryVCFsubmit.data.aws_iam_policy_document.logs[0]: Reading...
module.svep[0].module.lambda-concat.data.aws_iam_policy_document.logs[0]: Reading...
module.svep[0].module.lambda-pluginClinvar.data.aws_iam_policy_document.logs[0]: Reading...
module.svep[0].module.lambda-concat.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=2976610245]
module.svep[0].module.lambda-queryVCFsubmit.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=3755487924]
module.svep[0].module.lambda-pluginClinvar.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=3858596192]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # module.cognito.data.aws_iam_policy_document.lambda-sendRegistrationEmail will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-sendRegistrationEmail" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "ses:SendEmail",
            ]
          + resources = [
              + "arn:aws:ses:ap-southeast-3:127214202110:identity/*",
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "ssm:GetParameter",
            ]
          + resources = [
              + "arn:aws:ssm:ap-southeast-3:127214202110:parameter/bui-ssm-beacon-ui-url",
            ]
        }
    }

  # module.cognito.data.aws_iam_policy_document.lambda-sendSvepJobEmail will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-sendSvepJobEmail" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "ses:SendEmail",
            ]
          + resources = [
              + "arn:aws:ses:ap-southeast-3:127214202110:identity/*",
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "ssm:GetParameter",
            ]
          + resources = [
              + "arn:aws:ssm:ap-southeast-3:127214202110:parameter/bui-ssm-beacon-ui-url",
            ]
        }
    }

  # module.cognito.data.aws_iam_policy_document.ses-sns-access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "ses-sns-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sns:Publish",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AllowSESToPublishToSNS"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "127214202110",
                ]
              + variable = "aws:SourceAccount"
            }

          + principals {
              + identifiers = [
                  + "ses.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.cognito.aws_iam_policy.admin_group_role_policy will be created
  + resource "aws_iam_policy" "admin_group_role_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "admin group permissions"
      + id               = (known after apply)
      + name             = "gaspi-admin-group-role-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:*"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::gasi-dataportal-*/projects/*"
                    },
                  + {
                      + Action    = "s3:ListBucket"
                      + Condition = {
                          + StringLike = {
                              + "s3:prefix" = [
                                  + "private/${cognito-identity.amazonaws.com:sub}/",
                                  + "private/${cognito-identity.amazonaws.com:sub}/*",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:s3:::gasi-dataportal-*"
                    },
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:GetObject",
                          + "s3:DeleteObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::gasi-dataportal-*/private/${cognito-identity.amazonaws.com:sub}/*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "Environment" = "uat"
          + "NAME"        = "cognito-infrastructure"
          + "Owner"       = "gaspi"
        }
    }

  # module.cognito.aws_iam_policy.manager_group_role_policy will be created
  + resource "aws_iam_policy" "manager_group_role_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "manager group permissions"
      + id               = (known after apply)
      + name             = "gaspi-manager-group-role-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:*"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::gasi-dataportal-*/projects/*"
                    },
                  + {
                      + Action    = "s3:ListBucket"
                      + Condition = {
                          + StringLike = {
                              + "s3:prefix" = [
                                  + "private/${cognito-identity.amazonaws.com:sub}/",
                                  + "private/${cognito-identity.amazonaws.com:sub}/*",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:s3:::gasi-dataportal-*"
                    },
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:GetObject",
                          + "s3:DeleteObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::gasi-dataportal-*/private/${cognito-identity.amazonaws.com:sub}/*"
                    },
                  + {
                      + Action   = "pricing:*"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "Environment" = "uat"
          + "NAME"        = "cognito-infrastructure"
          + "Owner"       = "gaspi"
        }
    }

  # module.cognito.aws_lambda_permission.SNSemailNotification will be created
  + resource "aws_lambda_permission" "SNSemailNotification" {
      + action              = "lambda:InvokeFunction"
      + function_name       = (known after apply)
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "CognitoBackendAllowSNSemailNotificationInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.cognito.aws_ses_configuration_set.ses_feedback_config will be created
  + resource "aws_ses_configuration_set" "ses_feedback_config" {
      + arn                        = (known after apply)
      + id                         = (known after apply)
      + last_fresh_start           = (known after apply)
      + name                       = "ses-feedback-config"
      + reputation_metrics_enabled = false
      + sending_enabled            = true
    }

  # module.cognito.aws_ses_event_destination.ses_feedback_event_destination will be created
  + resource "aws_ses_event_destination" "ses_feedback_event_destination" {
      + arn                    = (known after apply)
      + configuration_set_name = "ses-feedback-config"
      + enabled                = true
      + id                     = (known after apply)
      + matching_types         = [
          + "bounce",
          + "complaint",
          + "delivery",
        ]
      + name                   = "ses-feedback-event-destination"

      + sns_destination {
          + topic_arn = (known after apply)
        }
    }

  # module.cognito.aws_sns_topic.sesDeliveryLogger will be created
  + resource "aws_sns_topic" "sesDeliveryLogger" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "sesDeliveryLogger"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags_all                    = {
          + "Environment" = "uat"
          + "NAME"        = "cognito-infrastructure"
          + "Owner"       = "gaspi"
        }
      + tracing_config              = (known after apply)
    }

  # module.cognito.aws_sns_topic_policy.sesDeliveryLogger will be created
  + resource "aws_sns_topic_policy" "sesDeliveryLogger" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + owner  = (known after apply)
      + policy = (known after apply)
    }

  # module.cognito.aws_sns_topic_subscription.sesDeliveryLogger will be created
  + resource "aws_sns_topic_subscription" "sesDeliveryLogger" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # module.sbeacon.data.archive_file.binaries_layer will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "binaries_layer" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "sbeacon/binaries.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "sbeacon/layers/binaries/"
      + type                = "zip"
    }

  # module.sbeacon.data.aws_iam_policy_document.athena-full-access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "athena-full-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "athena:GetQueryExecution",
              + "athena:GetQueryResults",
              + "athena:StartQueryExecution",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "glue:*",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:*",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:Query",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.athena-readonly-access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "athena-readonly-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "athena:GetQueryExecution",
              + "athena:GetQueryResults",
              + "athena:StartQueryExecution",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "glue:*",
            ]
          + resources = [
              + "*",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.dataportal-locks-access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "dataportal-locks-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:BatchGetItem",
              + "dynamodb:BatchWriteItem",
              + "dynamodb:DeleteItem",
              + "dynamodb:DescribeTable",
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.dynamodb-onto-access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "dynamodb-onto-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:BatchGetItem",
              + "dynamodb:DescribeTable",
              + "dynamodb:GetItem",
              + "dynamodb:Scan",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.dynamodb-onto-write-access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "dynamodb-onto-write-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:BatchWriteItem",
              + "dynamodb:DeleteItem",
              + "dynamodb:DescribeTable",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.dynamodb-quota-access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "dynamodb-quota-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:BatchGetItem",
              + "dynamodb:DescribeTable",
              + "dynamodb:GetItem",
              + "dynamodb:Scan",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.ec2_deidentification_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "ec2_deidentification_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + (known after apply),
            ]

          + condition {
              + test     = "StringLike"
              + values   = [
                  + "projects/*/project-files/*",
                  + "staging/projects/*/project-files/*",
                ]
              + variable = "s3:prefix"
            }
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.extra-glue-policy-document will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "extra-glue-policy-document" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetBucketAcl",
              + "s3:GetBucketLocation",
              + "s3:GetObject",
              + "s3:ListAllMyBuckets",
              + "s3:ListBucket",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.lambda-deidentifyFiles will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-deidentifyFiles" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:HeadObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "ec2:CreateTags",
              + "ec2:DescribeImages",
              + "ec2:DescribeInstances",
              + "ec2:RunInstances",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "iam:PassRole",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.lambda-getAnalyses will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-getAnalyses" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:ListBucket",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.lambda-getBiosamples will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-getBiosamples" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:ListBucket",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.lambda-getDatasets will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-getDatasets" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:ListBucket",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.lambda-getGenomicVariants will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-getGenomicVariants" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:ListBucket",
            ]
          + resources = [
              + "*",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.lambda-getIndividuals will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-getIndividuals" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:ListBucket",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.lambda-getProjects will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-getProjects" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:DescribeTable",
              + "dynamodb:GetItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.lambda-getRuns will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-getRuns" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:ListBucket",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.lambda-splitQuery will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-splitQuery" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.lambda-updateFiles will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-updateFiles" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + (known after apply),
            ]

          + condition {
              + test     = "StringLike"
              + values   = [
                  + "projects/*/project-files/*",
                  + "staging/projects/*/project-files/*",
                ]
              + variable = "s3:prefix"
            }
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:BatchGetItem",
              + "dynamodb:DeleteItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:Query",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.sbeacon.aws_api_gateway_integration.projects will be created
  + resource "aws_api_gateway_integration" "projects" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_integration_response.projects will be created
  + resource "aws_api_gateway_integration_response" "projects" {
      + http_method        = "GET"
      + id                 = (known after apply)
      + resource_id        = (known after apply)
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = (known after apply)
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_method.projects will be created
  + resource "aws_api_gateway_method" "projects" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method_response.projects will be created
  + resource "aws_api_gateway_method_response" "projects" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_resource.admin will be created
  + resource "aws_api_gateway_resource" "admin" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "admin"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.admin_proxy will be created
  + resource "aws_api_gateway_resource" "admin_proxy" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "{proxy+}"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.analyses will be created
  + resource "aws_api_gateway_resource" "analyses" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "analyses"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.analyses-filtering_terms will be created
  + resource "aws_api_gateway_resource" "analyses-filtering_terms" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "filtering_terms"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.analyses-id will be created
  + resource "aws_api_gateway_resource" "analyses-id" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "{id}"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.analyses-id-g_variants will be created
  + resource "aws_api_gateway_resource" "analyses-id-g_variants" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "g_variants"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.biosamples will be created
  + resource "aws_api_gateway_resource" "biosamples" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "biosamples"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.biosamples-filtering_terms will be created
  + resource "aws_api_gateway_resource" "biosamples-filtering_terms" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "filtering_terms"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.biosamples-id will be created
  + resource "aws_api_gateway_resource" "biosamples-id" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "{id}"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.biosamples-id-analyses will be created
  + resource "aws_api_gateway_resource" "biosamples-id-analyses" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "analyses"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.biosamples-id-g_variants will be created
  + resource "aws_api_gateway_resource" "biosamples-id-g_variants" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "g_variants"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.biosamples-id-runs will be created
  + resource "aws_api_gateway_resource" "biosamples-id-runs" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "runs"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.configuration will be created
  + resource "aws_api_gateway_resource" "configuration" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "configuration"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.datasets will be created
  + resource "aws_api_gateway_resource" "datasets" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "datasets"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.datasets-filtering_terms will be created
  + resource "aws_api_gateway_resource" "datasets-filtering_terms" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "filtering_terms"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.datasets-id will be created
  + resource "aws_api_gateway_resource" "datasets-id" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "{id}"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.datasets-id-biosamples will be created
  + resource "aws_api_gateway_resource" "datasets-id-biosamples" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "biosamples"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.datasets-id-filtering_terms will be created
  + resource "aws_api_gateway_resource" "datasets-id-filtering_terms" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "filtering_terms"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.datasets-id-g_variants will be created
  + resource "aws_api_gateway_resource" "datasets-id-g_variants" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "g_variants"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.datasets-id-individuals will be created
  + resource "aws_api_gateway_resource" "datasets-id-individuals" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "individuals"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.dportal will be created
  + resource "aws_api_gateway_resource" "dportal" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "dportal"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.dportal_proxy will be created
  + resource "aws_api_gateway_resource" "dportal_proxy" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "{proxy+}"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.entry_types will be created
  + resource "aws_api_gateway_resource" "entry_types" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "entry_types"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.filtering_terms will be created
  + resource "aws_api_gateway_resource" "filtering_terms" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "filtering_terms"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.g_variants will be created
  + resource "aws_api_gateway_resource" "g_variants" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "g_variants"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.g_variants-id will be created
  + resource "aws_api_gateway_resource" "g_variants-id" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "{id}"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.g_variants-id-biosamples will be created
  + resource "aws_api_gateway_resource" "g_variants-id-biosamples" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "biosamples"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.g_variants-id-individuals will be created
  + resource "aws_api_gateway_resource" "g_variants-id-individuals" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "individuals"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.individuals will be created
  + resource "aws_api_gateway_resource" "individuals" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "individuals"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.individuals-filtering_terms will be created
  + resource "aws_api_gateway_resource" "individuals-filtering_terms" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "filtering_terms"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.individuals-id will be created
  + resource "aws_api_gateway_resource" "individuals-id" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "{id}"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.individuals-id-biosamples will be created
  + resource "aws_api_gateway_resource" "individuals-id-biosamples" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "biosamples"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.individuals-id-g_variants will be created
  + resource "aws_api_gateway_resource" "individuals-id-g_variants" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "g_variants"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.info will be created
  + resource "aws_api_gateway_resource" "info" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "info"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.map will be created
  + resource "aws_api_gateway_resource" "map" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "map"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.projects will be created
  + resource "aws_api_gateway_resource" "projects" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "projects"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.runs will be created
  + resource "aws_api_gateway_resource" "runs" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "runs"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.runs-filtering_terms will be created
  + resource "aws_api_gateway_resource" "runs-filtering_terms" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "filtering_terms"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.runs-id will be created
  + resource "aws_api_gateway_resource" "runs-id" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "{id}"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.runs-id-analyses will be created
  + resource "aws_api_gateway_resource" "runs-id-analyses" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "analyses"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_resource.runs-id-g_variants will be created
  + resource "aws_api_gateway_resource" "runs-id-g_variants" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "g_variants"
      + rest_api_id = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_rest_api.BeaconApi will be created
  + resource "aws_api_gateway_rest_api" "BeaconApi" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + created_date                 = (known after apply)
      + description                  = "API That implements the Beacon specification"
      + 
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.